app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 0]]
---
  def description
    puts "#{params}"
    product = Product.find(params[:id])